app/controllers/event_replies_controller.rb

INSERT INTO `event_replies` (`event_id`, `name`, `food`, `updated_at`, `comments`, `email`, `created_at`) VALUES(NULL, 'Karl Persson', '', '2009-05-10 14:19:21', '', 'kalle', '2009-05-10 14:19:21')
---
  def create
    if request.format == :xml
      params[:event_reply][:send_signup_confirmation] = false if params[:event_reply][:send_signup_confirmation].nil?
    end
    @reply = @event.replies.new(params[:event_reply])

    respond_to do |format|
      if @reply.save

SELECT * FROM `events` WHERE (`events`.`id` = 996333065)
---
  def load_parents
    @event = Event.find(params[:event_id])