app/controllers/events_controller.rb

SELECT * FROM `events`
---
  def index
    # TODO AUTH
    #@events = Event.with_permissions_to(:manage)
    @events = Event.all

INSERT INTO `events` (`name`, `food`, `updated_at`, `date`, `max_guests`, `description`, `deadline`, `ref_prefix`, `comment`, `created_at`) VALUES('My event', NULL, '2009-05-10 14:07:10', '2009-09-09 09:09:00', 0, NULL, '2009-08-08 08:08:00', '', NULL, '2009-05-10 14:07:10')
---
  def create
    @event = Event.new(params[:event])
    # TODO AUTH
    #@event.user = current_user

    if @event.save

DELETE FROM `events` WHERE `id` = 953125641
---
  def destroy
    @event.destroy

SELECT * FROM `events` WHERE (`events`.`id` = 953125641)
---
  def load_event
    @event = Event.find(params[:id])